package com.example.scheduler


enum class Subject(val subject: String){
    Web("Web-технологии"),
    BigData("Большие данные"),
    Ether("Интернет вещей"),
    Methods("Методы и средства проектирования информационных систем и технологий"),
    Model("Моделирование систем"),
    OVP("Основы военной подготовки"),
    Design("Практикум дизайна"),
    Phizra("Прикладная физическая культура (элективный модуль)")

}
enum class Prepods(val prepod: String){
    Krasiln("Красильникова Ольга Ивановна"),
    Bogoslov("Богословская Наталья Валентиновна"),
    Shevakov("Шевяков Даниил Олегович"),
    Brezjev("Бржезовский Александр Викторович"),
    Tatar("Татарникова Татьяна Михайловна"),
    Bahtev("Бахтеев Алексей Павлович"),
    Syet("Суетина Татьяна Александровна"),
    Perel("Перельман Михаил Борисович"),
    Savel("Савельева Дарья Дмитриевна"),
    Drozd("Дроздецкий Сергей Игоревич")
}
enum class Classroom(val classroom:String){
    L1307("13-07 (Ленсовета 14)"),
    L1319("13-19 (Ленсовета 14)"),
    B1314("13-14 (Б. Морская 67)"),
    B2317("23-17 (Б. Морская 67)"),
    B3203("32-03 (Б. Морская 67)"),
    B3302("33-02 (Б. Морская 67)"),
    B3304("33-04 (Б. Морская 67)"),
    B3305("33-05 (Б. Морская 67)"),
    B3307("33-07 (Б. Морская 67)"),
    B5218("52-18 (Б. Морская 67)"),
    B5219("52-19 (Б. Морская 67)"),
    B5304("53-04 (Б. Морская 67)"),
    S("спортзал (Б. Морская 67)")
}
enum class TypeOfSubject(val typeSub:String){
    Lab("Лабораторное занятие"),
    Lek("Лекция"),
    Pra("Практическое занятие")
}
enum class Times(val stTime:Array<String>){
    StartTimes(arrayOf("9:30", "11:10", "13:00", "15:00", "16:40", "18:30")),
    EndTimes(arrayOf("11:00", "12:40", "14:30", "16:30", "18:10", "20:00"));




}